src/Catalogs/БЗ_КатегорииБазыЗнаний/БЗ_КатегорииБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_КатегорииБазыЗнаний</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_Контрагент</name>
    <comment>Конкретное задание группы статей по контрагенту (заказчику)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПоказыватьДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющиеВопросыДляСтикера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_НоменклатураПоУмолчанию</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_ТекстДляДобавленияВЗадание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_ВзятьТекстИзСервисныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботыВРамкахИТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УровниКомпетенции</name>
    <attributes>
      <name>Требования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/БЗ_КатегорииБазыЗнаний/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Родитель) Тогда
		Объект.Тип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Родитель, "Тип");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("КатегорииБазыЗнанийЗапись", , Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура АйТи_УровниКомпетенцииТребованияНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.УровниКомпетенции.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Текст, Заголовок", ТекущиеДанные.Требования, "Редактирование требования");  
	ВозвращаемыйКомментарий = Неопределено;
	
	ОП = Новый ОписаниеОповещения("ПослеОкончанияРедактированияТекста", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные));
	ОткрытьФорму("ОбщаяФорма.РедактированиеТекста", ПараметрыФормы,,,,, ОП, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияТекста(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Если ТекущиеДанные.Требования <> Результат Тогда
			Модифицированность = Истина;
			ТекущиеДанные.Требования = Результат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
